Thenewmanator15/esp32c6-sniffer/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Console on UART0 (GPIO16, header pin D6). The SECONDARY setting is critical:
# the ESP-IDF default also mirrors console output onto USB-Serial-JTAG, which
# would inject log text into the framed data stream.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Light sleep gates the USB PHY clock and kills the link.
CONFIG_PM_ENABLE=n

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000

# IEEE 802.15.4 capture.
# More receive buffers than the default 20, so a burst is not lost while the
# USB task drains. Each costs about 128 bytes.
CONFIG_IEEE802154_RX_BUFFER_SIZE=50
# The driver's "Rx buffer full" warning is compiled out unless this is set,
# which makes overflow completely invisible in a default build.
CONFIG_IEEE802154_DEBUG=y

# Channel state information. Off by default in ESP-IDF, and without it
# esp_wifi_set_csi_config() returns a bare ESP_FAIL: the API is present, the
# driver support is not compiled in. Costs a 512-byte static receive buffer.
CONFIG_ESP_WIFI_CSI_ENABLED=y

# Bluetooth: controller only, no host stack. The sniffer drives HCI directly,
# so what reaches Wireshark is the controller's own events byte for byte and
# a host stack would only get in the way (and cost tens of kilobytes).
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ONLY=y
CONFIG_BT_BLE_ENABLED=y

# Identity resolving keys, for following a device that changes its address.
# Five is this controller's Kconfig maximum (range 1 to 5, default 4). The
# host reads the same number from boards.py "ble_keys".
CONFIG_BT_LE_LL_RESOLV_LIST_SIZE=5

# The Bluetooth controller pushes the binary past the default 1 MB app
# partition, so the layout is ours: see partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
